huangqiang2007/NFR51822/nRF5_SDK_12.2.0_f012efa_verified/examples/hq_test/consumer_and_keyboard_nrf51822.c
static pm_peer_id_t   m_whitelist_peers[BLE_GAP_WHITELIST_ADDR_MAX_COUNT];  /**< List of peers currently in the whitelist. */
static uint32_t       m_whitelist_peer_cnt;                                 /**< Number of peers currently in the whitelist. */
static bool           m_is_wl_changed;                                      /**< Indicates if the whitelist has been changed since last time it has been updated in the Peer Manager. */

static ble_uuid_t m_adv_uuids[] = {{BLE_UUID_HUMAN_INTERFACE_DEVICE_SERVICE, BLE_UUID_TYPE_BLE}};

/**< key code array. */
static uint8_t m_key_code[][14] = {
	/*ESC F1 F2 F3 F4 F5 F6 F7 F8 F9 F10 F11 F12 CF5 */
	{0x29, 0x3A, 0x3B, 0x3C, 0x3D, 0x3E, 0x3F, 0x40, 0x41, 0x42, 0x43, 0x44, 0x45, 0x00},
	
	/*` 1 2 3 4 5 6 7 8 9 0 - = Backspace*/	
	{0x32, 0x1E, 0x1F, 0x20, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27, 0x2D, 0x2E, 0x2A},
	
	/*Tab Q W E R T Y U I O P [ ] Return*/
	{0x2B, 0x14, 0x1A, 0x08, 0x15, 0x17, 0x1C, 0x18, 0x0C, 0x12, 0x13, 0x2F, 0x30, 0x28},
	
	/*Caps A S D F G H J K L ; " null null*/
	{0x39, 0x04, 0x16, 0x07, 0x09, 0x0A, 0x0B, 0x0D, 0x0E, 0x0F, 0x33, 0x34, 0x2C, 0x2C},
	
	/*Shift Z X C V B N M , . ? UP \ null*/
	{0xE1, 0x1D, 0x1B, 0x06, 0x19, 0x06, 0x11, 0x10, 0x36, 0x37, 0x38, 0x52, 0x31, 0x2C},
	
	/*Ctrl wins FN ALT Spa Spa Spa Spa ALT null DEL left down rifgt*/
	{0xE0, 0x0, 0x0, 0xE2, 0x2C, 0x2C, 0x2C, 0x2C, 0xE6, 0x00, 0x4C, 0x50, 0x51, 0x4F},
};

static uint8_t m_sample_key_press_scan_str1[] = /**< Key pattern to be sent when the key press button has been pushed. */
{
    0x0b,                                      /* Key h */
    0x08,                                      /* Key e */
    0x0f,                                      /* Key l */
    0x0f,                                      /* Key l */
    0x12,                                      /* Key o */
    0x28                                       /* Key Return */
};

static uint8_t m_sample_key_press_scan_str[] = 
{0x32, 0x1E, 0x1F, 0x20, 0x21, 0x22, 0x23, 0x24, 0x25, 0x26, 0x27, 0x2D, 0x2E, 0x2A};
/*
0x2B, 0x14, 0x1A, 0x08, 0x15, 0x17, 0x1C, 0x18, 0x0C, 0x12, 0x13, 0x2F, 0x30, 0x28,
0x04, 0x16, 0x07, 0x09, 0x0A, 0x0B, 0x0D, 0x0E, 0x0F, 0x33, 0x34, 0x2C, 0x2C,
0xE1, 0x1D, 0x1B, 0x06, 0x19, 0x06, 0x11, 0x10, 0x36, 0x37, 0x38, 0x52, 0x31, 0x2C};
*/
static uint8_t m_caps_on_key_scan_str[] = /**< Key pattern to be sent when the output report has been written with the CAPS LOCK bit set. */
{
    0x06,                                 /* Key C */
    0x04,                                 /* Key a */
    0x13,                                 /* Key p */
    0x16,                                 /* Key s */
    0x12,                                 /* Key o */
    0x11,                                 /* Key n */
};

static uint8_t m_caps_off_key_scan_str[] = /**< Key pattern to be sent when the output report has been written with the CAPS LOCK bit cleared. */
{
    0x06,                                  /* Key C */
    0x04,                                  /* Key a */
    0x13,                                  /* Key p */
    0x16,                                  /* Key s */
    0x12,                                  /* Key o */
    0x09,                                  /* Key f */
};

static volatile uint8_t g_modifier_key_bit = 0;

// This enum is mapped to "rep_map_data[]", Report ID 3.
// Please see the USB descriptor for detailed information.
typedef enum
{
    MM_KEY_RELEASE =            0x00,
    MM_KEY_PLAY_PAUSE =         0x01,
    MM_KEY_AL_CCC =             0x02,
    MM_KEY_SCAN_NEXT_TRACK =    0x04,
    MM_KEY_SCAN_PREV_TRACK =    0x08,
    MM_KEY_VOL_DOWN =           0x10,
    MM_KEY_VOL_UP =             0x20,    
    MM_KEY_AC_FORWARD =         0x40,
    MM_KEY_AC_BACK =            0x80,
} multimedia_keys_t;

#define BUTTON_DETECTION_DELAY          APP_TIMER_TICKS(50, APP_TIMER_PRESCALER)    /**< Delay from a GPIOTE event until a button is reported as pushed (in number of timer ticks). */


/** List to enqueue not just data to be sent, but also related information like the handle, connection handle etc */
static buffer_list_t buffer_list;

static void on_hids_evt(ble_hids_t * p_hids, ble_hids_evt_t * p_evt);

/**@brief Callback function for asserts in the SoftDevice.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in]   line_num   Line number of the failing ASSERT call.
 * @param[in]   file_name  File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/**@brief Fetch the list of peer manager peer IDs.
 *
 * @param[inout] p_peers   The buffer where to store the list of peer IDs.
 * @param[inout] p_size    In: The size of the @p p_peers buffer.
 *                         Out: The number of peers copied in the buffer.
 */
static void peer_list_get(pm_peer_id_t * p_peers, uint32_t * p_size)
{
    pm_peer_id_t peer_id;
    uint32_t     peers_to_copy;

    peers_to_copy = (*p_size < BLE_GAP_WHITELIST_ADDR_MAX_COUNT) ?
                     *p_size : BLE_GAP_WHITELIST_ADDR_MAX_COUNT;

    peer_id = pm_next_peer_id_get(PM_PEER_ID_INVALID);
    *p_size = 0;

    while ((peer_id != PM_PEER_ID_INVALID) && (peers_to_copy--))
    {
        p_peers[(*p_size)++] = peer_id;
        peer_id = pm_next_peer_id_get(peer_id);
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    ret_code_t ret;

    memset(m_whitelist_peers, PM_PEER_ID_INVALID, sizeof(m_whitelist_peers));
    m_whitelist_peer_cnt = (sizeof(m_whitelist_peers) / sizeof(pm_peer_id_t));

    peer_list_get(m_whitelist_peers, &m_whitelist_peer_cnt);

    ret = pm_whitelist_set(m_whitelist_peers, m_whitelist_peer_cnt);
    APP_ERROR_CHECK(ret);

    // Setup the device identies list.
    // Some SoftDevices do not support this feature.
    ret = pm_device_identities_list_set(m_whitelist_peers, m_whitelist_peer_cnt);
    if (ret != NRF_ERROR_NOT_SUPPORTED)
    {
        APP_ERROR_CHECK(ret);
    }

