huangqiang2007/NFR51822/nRF5_SDK_12.2.0_f012efa_verified/examples/hq_test/consumer_and_keyboard_nrf51822.c
    nrf_clock_lf_cfg_t clock_lf_cfg = NRF_CLOCK_LFCLKSRC;

    // Initialize the SoftDevice handler module.
    SOFTDEVICE_HANDLER_APPSH_INIT(&clock_lf_cfg, true);

    ble_enable_params_t ble_enable_params;
    err_code = softdevice_enable_get_default_config(CENTRAL_LINK_COUNT,
                                                    PERIPHERAL_LINK_COUNT,
                                                    &ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Check the ram settings against the used number of links
    CHECK_RAM_START_ADDR(CENTRAL_LINK_COUNT, PERIPHERAL_LINK_COUNT);

    // Enable BLE stack.
#if (NRF_SD_BLE_API_VERSION == 3)
    ble_enable_params.gatt_enable_params.att_mtu = NRF_BLE_MAX_MTU_SIZE;
#endif
    err_code = softdevice_enable(&ble_enable_params);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_ble_evt_handler_set(ble_evt_dispatch);
    APP_ERROR_CHECK(err_code);

    // Register with the SoftDevice handler module for BLE events.
    err_code = softdevice_sys_evt_handler_set(sys_evt_dispatch);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for the Event Scheduler initialization.
 */
static void scheduler_init(void)
{
    APP_SCHED_INIT(SCHED_MAX_EVENT_DATA_SIZE, SCHED_QUEUE_SIZE);
}

/**@brief Function for handling events from the BSP module.
 *
 * @param[in]   event   Event generated by button press.
 */

#define MOVEMENT_SPEED 100
#define INPUT_REP_MOVEMENT_INDEX 1
#define INPUT_REP_MOVEMENT_LEN 3

static void mouse_movement_send(int16_t x_delta, int16_t y_delta)
{
    uint32_t err_code;

    if (m_in_boot_mode)
    {
        x_delta = MIN(x_delta, 0x00ff);
        y_delta = MIN(y_delta, 0x00ff);

        err_code = ble_hids_boot_mouse_inp_rep_send(&m_hids,
                                                    0x00,
                                                    (int8_t)x_delta,
                                                    (int8_t)y_delta,
                                                    0,
                                                    NULL);
    }
    else
    {
        uint8_t buffer[INPUT_REP_MOVEMENT_LEN];

        APP_ERROR_CHECK_BOOL(INPUT_REP_MOVEMENT_LEN == 3);

        x_delta = MIN(x_delta, 0x0fff);
        y_delta = MIN(y_delta, 0x0fff);

        buffer[0] = x_delta & 0x00ff;
        buffer[1] = ((y_delta & 0x000f) << 4) | ((x_delta & 0x0f00) >> 8);
        buffer[2] = (y_delta & 0x0ff0) >> 4;

        err_code = ble_hids_inp_rep_send(&m_hids,
                                         INPUT_REP_MOVEMENT_INDEX,
                                         INPUT_REP_MOVEMENT_LEN,
                                         buffer);
    }

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_NO_TX_PACKETS) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)
       )
    {
        APP_ERROR_HANDLER(err_code);
    }
}

#if MULTTOUCH_ENABLE
static void mouse_moveto_2xy(uint8_t value,uint16_t x_delta,uint16_t y_delta,
										uint16_t x2_delta,uint16_t y2_delta)
{
	// With this declaration a data packet must be sent as:
	// byte 1   -> "contact count"        (always == 1)
	// byte 2   -> "contact identifier"   (any value)
	// byte 3   -> "Tip Switch" state     (bit 0 = Tip Switch up/down, bit 1 = In Range)
	// byte 4,5 -> absolute X coordinate  (0...10000)
	// byte 6,7 -> absolute Y coordinate  (0...10000)
	uint8_t buffer[INPUT_REP_TOUCH_LEN];
	uint32_t err_code;
	APP_ERROR_CHECK_BOOL(INPUT_REP_TOUCH_LEN == 13);

	x_delta = MIN(x_delta, 0x2710);
	y_delta = MIN(y_delta, 0x2710);

	buffer[0] =  2;
	buffer[1] =  1;
	buffer[2] =  value;
	buffer[3] = x_delta & 0x00ff;
	buffer[4] = (x_delta>>8)&0x00ff;
	buffer[5] = y_delta & 0x00ff;
	buffer[6] = (y_delta>>8)&0x00ff;

	buffer[7] =  2;
	buffer[8] =  value;
	buffer[9] = x2_delta & 0x00ff;
	buffer[10] = (x2_delta>>8)&0x00ff;
	buffer[11] = y2_delta & 0x00ff;
	buffer[12] = (y2_delta>>8)&0x00ff;

	err_code = ble_hids_inp_rep_send(&m_hids,
				INPUT_REP_TOUCH_INDEX,
				INPUT_REP_TOUCH_LEN,
				buffer);
	if ((err_code != NRF_SUCCESS) &&
	(err_code != NRF_ERROR_INVALID_STATE) &&
	(err_code != BLE_ERROR_NO_TX_PACKETS) &&
	(err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING))
	{
		APP_ERROR_HANDLER(err_code);
	}
}

static void touch_emulation(bsp_event_t event)
{
	static uint16_t touch_num = 8000;
	static uint16_t touch_num2 = 2000;

	switch (event)
	{
		case BSP_EVENT_KEY_1:
			if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
				mouse_moveto_2xy(1,touch_num,touch_num, touch_num2, touch_num2);
				touch_num -= 100;
				if(touch_num < 1000)
					touch_num = 8000;

				touch_num2 += 100;
				if(touch_num2 > 8000)
					touch_num2 = 1000;
			}
			break;

		case BSP_EVENT_KEY_3:
			if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {
				mouse_moveto_2xy(1,touch_num2,touch_num2, touch_num,touch_num);
				touch_num -= 100;
				if(touch_num < 1000)
					touch_num = 8000;

				touch_num2 += 100;
				if(touch_num2 > 8000)
					touch_num2 = 1000;
			}
			break;

		default:
		//					mouse_moveto_2xy(0,5000,5000);
		//					touch_num=5000;
		break;
	}
}
#endif

static void mouse_movement_send2(int16_t x_delta, int16_t y_delta, int8_t wheel)
{
    uint32_t err_code;

    if (m_in_boot_mode) {
        x_delta = MIN(x_delta, 0x00ff);
        y_delta = MIN(y_delta, 0x00ff);

        err_code = ble_hids_boot_mouse_inp_rep_send(&m_hids,
                                                    0x00,
                                                    (int8_t)x_delta,
                                                    (int8_t)y_delta,
                                                    0,
                                                    NULL);
    } else {
        uint8_t buffer[INPUT_REP_MOUSE_MAX_LEN] = {0};

        APP_ERROR_CHECK_BOOL(INPUT_REP_MOUSE_MAX_LEN == 6);

        x_delta = MIN(x_delta, 0x0fff);
        y_delta = MIN(y_delta, 0x0fff);

        buffer[1] = x_delta & 0x00ff;
        buffer[2] = ((y_delta & 0x000f) << 4) | ((x_delta & 0x0f00) >> 8);
        buffer[3] = (y_delta & 0x0ff0) >> 4;
		buffer[4] = wheel & 0x00ff;
		buffer[5] = (wheel & 0x0f00) >> 8;

        err_code = ble_hids_inp_rep_send(&m_hids,
                                         INPUT_REP_MOUSE_INDEX,
                                         INPUT_REP_MOUSE_MAX_LEN,
                                         buffer);
    }

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_NO_TX_PACKETS) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)) {
        APP_ERROR_HANDLER(err_code);
    }
}

static void mouse_media_send(uint8_t action)
{
    uint32_t err_code;    
    uint8_t buffer[INPUT_REP_ZOOM_MAX_LEN] = {0};

    APP_ERROR_CHECK_BOOL(INPUT_REP_ZOOM_MAX_LEN == 1);

    buffer[0] = action;
    err_code = ble_hids_inp_rep_send(&m_hids,
                                     0,
                                     INPUT_REP_ZOOM_MAX_LEN,
                                     buffer);

    if ((err_code != NRF_SUCCESS) &&
        (err_code != NRF_ERROR_INVALID_STATE) &&
        (err_code != BLE_ERROR_NO_TX_PACKETS) &&
        (err_code != BLE_ERROR_GATTS_SYS_ATTR_MISSING)) {
        APP_ERROR_HANDLER(err_code);
    } else {
		// Start timer for sending release key
        app_timer_start(m_hid_button_timer_id, BUTTON_DETECTION_DELAY, NULL);
	}
}


static void bsp_event_handler(bsp_event_t event)
{
	uint32_t		err_code;
	static uint8_t *p_key = m_sample_key_press_scan_str;
	static uint8_t  size  = 0;
	static uint8_t	cap = 0x39;

